tap "homebrew/bundle"
tap "micronaut-projects/tap"
# New file format for still image compression
brew "jpeg-xl"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Freely available high-quality data compressor
brew "bzip2"
# Core application library for C
brew "glib"
# Automated changelog tool for preparing releases
brew "changie"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Libraries to talk to Microsoft SQL Server and Sybase databases
brew "freetds"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Kubernetes package manager
brew "helm"
# Key-value storage library with ordered mapping
brew "leveldb"
# General-purpose lossless data-compression library
brew "zlib"
# Open source relational database management system
brew "mysql-client"
# Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@14"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# User interface to the TELNET protocol
brew "telnet"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
cask "micronaut"
vscode "ahmadawais.shades-of-purple"
vscode "dbaeumer.vscode-eslint"
vscode "ecmel.vscode-html-css"
vscode "efanzh.graphviz-preview"
vscode "esbenp.prettier-vscode"
vscode "extr0py.vscode-relative-line-numbers"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.code-runner"
vscode "gabrielgrinberg.auto-run-command"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "hollowtree.vue-snippets"
vscode "humao.rest-client"
vscode "isudox.vscode-jetbrains-keybindings"
vscode "jebbs.plantuml"
vscode "johnpapa.winteriscoming"
vscode "k--kato.intellij-idea-keybindings"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ko"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "octref.vetur"
vscode "pkief.material-icon-theme"
vscode "ritwickdey.liveserver"
vscode "robertpiosik.gemini-coder"
vscode "rust-lang.rust-analyzer"
vscode "sdras.night-owl"
vscode "slevesque.vscode-zipexplorer"
vscode "solomonkinard.git-blame"
vscode "the0807.uv-toolkit"
vscode "thomaz.preparing"
vscode "tomoki1207.pdf"
vscode "vscodevim.vim"
vscode "yhpnoraa.beauty"
