adpyke.codesnap
ahmadawais.shades-of-purple
dbaeumer.vscode-eslint
ecmel.vscode-html-css
efanzh.graphviz-preview
esbenp.prettier-vscode
extr0py.vscode-relative-line-numbers
formulahendry.auto-close-tag
formulahendry.code-runner
gabrielgrinberg.auto-run-command
github.copilot
github.copilot-chat
golang.go
hollowtree.vue-snippets
humao.rest-client
isudox.vscode-jetbrains-keybindings
jebbs.plantuml
johnpapa.winteriscoming
k--kato.intellij-idea-keybindings
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-ko
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.makefile-tools
octref.vetur
pkief.material-icon-theme
ritwickdey.liveserver
robertpiosik.gemini-coder
rust-lang.rust-analyzer
sdras.night-owl
sleistner.vscode-fileutils
slevesque.vscode-zipexplorer
solomonkinard.git-blame
the0807.uv-toolkit
thomaz.preparing
tomoki1207.pdf
vscodevim.vim
yhpnoraa.beauty
