ahmadawais.shades-of-purple@7.3.2
dbaeumer.vscode-eslint@3.0.10
ecmel.vscode-html-css@2.0.13
efanzh.graphviz-preview@1.7.5
esbenp.prettier-vscode@11.0.0
extr0py.vscode-relative-line-numbers@0.0.5
formulahendry.auto-close-tag@0.5.15
formulahendry.code-runner@0.12.2
gabrielgrinberg.auto-run-command@1.6.0
github.copilot@1.336.0
github.copilot-chat@0.28.1
golang.go@0.46.1
hollowtree.vue-snippets@1.0.4
humao.rest-client@0.25.1
isudox.vscode-jetbrains-keybindings@0.1.9
jebbs.plantuml@2.18.1
johnpapa.winteriscoming@1.4.4
k--kato.intellij-idea-keybindings@1.7.4
ms-azuretools.vscode-containers@2.0.3
ms-azuretools.vscode-docker@2.0.0
ms-ceintl.vscode-language-pack-ko@1.101.2025061109
ms-python.debugpy@2025.8.0
ms-python.python@2025.8.0
ms-python.vscode-pylance@2025.6.1
ms-toolsai.jupyter@2025.5.0
ms-toolsai.jupyter-keymap@1.1.2
ms-toolsai.jupyter-renderers@1.1.0
ms-vscode-remote.remote-containers@0.417.0
ms-vscode-remote.remote-ssh@0.120.0
ms-vscode-remote.remote-ssh-edit@0.87.0
ms-vscode.makefile-tools@0.12.17
octref.vetur@0.37.3
pkief.material-icon-theme@5.23.0
ritwickdey.liveserver@5.7.9
robertpiosik.gemini-coder@1.118.0
rust-lang.rust-analyzer@0.3.2500
sdras.night-owl@2.1.1
slevesque.vscode-zipexplorer@0.3.1
solomonkinard.git-blame@0.2.74
the0807.uv-toolkit@0.0.2
thomaz.preparing@1.7.0
tomoki1207.pdf@1.2.2
vscodevim.vim@1.30.1
yhpnoraa.beauty@0.0.2
