aaron-bond.better-comments
adpyke.codesnap
ahmadawais.shades-of-purple
alefragnani.bookmarks
dbaeumer.vscode-eslint
eamodio.gitlens
ecmel.vscode-html-css
efanzh.graphviz-preview
esbenp.prettier-vscode
extr0py.vscode-relative-line-numbers
formulahendry.auto-close-tag
formulahendry.code-runner
gabrielgrinberg.auto-run-command
github.copilot
github.copilot-chat
github.github-vscode-theme
github.remotehub
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
google.gemini-cli-vscode-ide-companion
harryhopkinson.vim-theme
hollowtree.vue-snippets
humao.rest-client
isudox.vscode-jetbrains-keybindings
james-yu.latex-workshop
jebbs.plantuml
johnpapa.winteriscoming
k--kato.intellij-idea-keybindings
lextudio.restructuredtext
mads-hartmann.bash-ide-vscode
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-ceintl.vscode-language-pack-ko
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.azure-repos
ms-vscode.makefile-tools
ms-vscode.remote-repositories
nefrob.vscode-just-syntax
octref.vetur
pkief.material-icon-theme
redhat.java
ritwickdey.liveserver
robertpiosik.gemini-coder
rust-lang.rust-analyzer
sdras.night-owl
shd101wyy.markdown-preview-enhanced
sleistner.vscode-fileutils
slevesque.vscode-zipexplorer
solomonkinard.git-blame
tamasfe.even-better-toml
the0807.uv-toolkit
thomaz.preparing
tomoki1207.pdf
vadimcn.vscode-lldb
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscjava.migrate-java-to-azure
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-java-upgrade
vscjava.vscode-maven
vscodevim.vim
yhpnoraa.beauty
yzhang.markdown-all-in-one
